# Data Analysis & Understanding

## imports and reading the data

In [16]:
import pandas as pd

In [17]:
customers = pd.read_csv("./customers.csv", delimiter=";")
invoices = pd.read_csv("./invoices.csv", delimiter=";")
positions = pd.read_csv("./positions.csv", delimiter=";")

In [18]:
customers

        id   Kdnr                                      Verlagsname     Region
0        5  20172                                   1. FC Nürnberg   Nürnberg
1       19  20137  Allgäuer Zeitung / Allgäuer Zeitungsverlag GmbH   Bodensee
2       27  20115                            Augsburger Allgemeine    München
3       69  10113                         Brainpool TV Productions  Rheinland
4       72  10154                 RFW / Redaktionsbüro Wipperfürth    Hamburg
..     ...    ...                                              ...        ...
596  14014  81391                                              PPF        NaN
597  14021  81398          VLAAMSE RADIO- EN TELEVISIEOMROEP (VRT)        NaN
598  14025  81402                           Umweltinstitut München        NaN
599  14031  81408                       Everprod - Groupe Elephant        NaN
600  14034  81411                                  Lennart Homeyer        NaN

[601 rows x 4 columns]

In [ ]:
customers.shape

(601, 4)

In [20]:
invoices.head()

,ReNummer,SummeNetto,MwStSatz,ZahlungsbetragBrutto,KdNr,Summenebenkosten,ReDatum,Zahlungsdatum
0,103601,11786.7,0,0.0,78911,0.0,2025-04-04 00:00:00.000,NaN
1,103600,379.0,7,0.0,79666,0.0,2025-04-03 00:00:00.000,NaN
2,103599,160.0,7,0.0,30145,0.0,2025-04-04 00:00:00.000,NaN
3,103598,225.0,7,0.0,10383,0.0,2025-04-01 00:00:00.000,NaN
4,103597,1260.0,7,0.0,20213,0.0,2025-04-03 00:00:00.000,NaN

In [21]:
invoices.shape

(2000, 8)

In [22]:
positions.head()

        id    ReId     KdNr  Nettobetrag   Bildnummer                 VerDatum
0  4154495  102038  50292.0         19.0  168161043.0  2022-09-29 00:00:00.000
1  4154496  102038  50292.0         19.0  108514408.0  2022-09-12 00:00:00.000
2  4154497  102038  50292.0         19.0   55374589.0  2022-09-08 00:00:00.000
3  4154498  102038  50292.0         19.0   55374589.0  2022-09-08 00:00:00.000
4  4154499  102038  50292.0         19.0   57865918.0  2022-09-08 00:00:00.000

In [23]:
positions.shape

(129092, 6)

## Merging the dataframes into a dataset

In [25]:
merged_data = pd.merge(
    invoices, positions, left_on="ReNummer", right_on="ReId", how="outer"
)

In [26]:
merged_data.head()

,ReNummer,SummeNetto,MwStSatz,ZahlungsbetragBrutto,KdNr_x,Summenebenkosten,ReDatum,Zahlungsdatum,id,ReId,KdNr_y,Nettobetrag,Bildnummer,VerDatum
0,101602,145.0,0,145.0,81044,0.0,2024-11-04 00:00:00.000,2024-11-08 00:00:00.000,4371424.0,101602.0,10988.0,8.38,1.012560e+09,2022-08-03 00:00:00.000
1,101602,145.0,0,145.0,81044,0.0,2024-11-04 00:00:00.000,2024-11-08 00:00:00.000,4371425.0,101602.0,10988.0,8.38,1.012138e+09,2022-08-03 00:00:00.000
2,101602,145.0,0,145.0,81044,0.0,2024-11-04 00:00:00.000,2024-11-08 00:00:00.000,4371426.0,101602.0,10988.0,8.38,1.012104e+09,2022-08-03 00:00:00.000
3,101602,145.0,0,145.0,81044,0.0,2024-11-04 00:00:00.000,2024-11-08 00:00:00.000,4371427.0,101602.0,10988.0,8.38,1.012356e+09,2022-08-05 00:00:00.000
4,101602,145.0,0,145.0,81044,0.0,2024-11-04 00:00:00.000,2024-11-08 00:00:00.000,4371428.0,101602.0,10988.0,8.38,1.013627e+09,2022-08-05 00:00:00.000

In [27]:
merged_data = merged_data.rename({"KdNr_x": "KdNr_inv", "KdNr_y": "KdNr_pos"}, axis=1)

In [28]:
merged_data = pd.merge(
    merged_data, customers, left_on="KdNr_inv", right_on="Kdnr", how="outer"
)

In [32]:
merged_data.shape

(129094, 18)

In [33]:
merged_data.head()

,ReNummer,SummeNetto,MwStSatz,ZahlungsbetragBrutto,KdNr_inv,Summenebenkosten,ReDatum,Zahlungsdatum,id_x,ReId,KdNr_pos,Nettobetrag,Bildnummer,VerDatum,id_y,Kdnr,Verlagsname,Region
0,101945,23000.0,7,24610.0,10039,0.0,2024-12-02 00:00:00.000,2024-12-17 00:00:00.000,4184851.0,101945.0,76147.0,32.89,170145663.0,2022-10-05 00:00:00.000,380,10039,info Network / RTL,Rheinland
1,101945,23000.0,7,24610.0,10039,0.0,2024-12-02 00:00:00.000,2024-12-17 00:00:00.000,4184852.0,101945.0,76147.0,32.89,170051534.0,2022-10-05 00:00:00.000,380,10039,info Network / RTL,Rheinland
2,101945,23000.0,7,24610.0,10039,0.0,2024-12-02 00:00:00.000,2024-12-17 00:00:00.000,4184853.0,101945.0,76147.0,32.89,116150742.0,2022-10-11 00:00:00.000,380,10039,info Network / RTL,Rheinland
3,101945,23000.0,7,24610.0,10039,0.0,2024-12-02 00:00:00.000,2024-12-17 00:00:00.000,4184854.0,101945.0,76147.0,32.89,170004281.0,2022-10-11 00:00:00.000,380,10039,info Network / RTL,Rheinland
4,101945,23000.0,7,24610.0,10039,0.0,2024-12-02 00:00:00.000,2024-12-17 00:00:00.000,4184855.0,101945.0,76147.0,32.89,152425274.0,2022-10-11 00:00:00.000,380,10039,info Network / RTL,Rheinland

In [116]:
merged_data.isnull().sum()

id_x                        0
Kdnr                        0
Verlagsname                 0
Region                  52296
ReNummer                    0
SummeNetto                  0
MwStSatz                    0
ZahlungsbetragBrutto        3
KdNr_x                      0
Summenebenkosten           19
ReDatum                     0
Zahlungsdatum           18012
id_y                        2
ReId                        2
KdNr_y                      3
Nettobetrag                 3
Bildnummer                  3
VerDatum                    6
dtype: int64

In [65]:
print(
    f"Number of positions missing an ReNummer: {len(merged_data[merged_data['ReNummer'].isna()])}"
)

Number of positions missing an ReNummer: 0

### How many positions are linked to invoices that are missing payment info

In [45]:
positions_missing_payment = merged_data[
    (merged_data["Zahlungsdatum"].isna())
    | (merged_data["ZahlungsbetragBrutto"].isna())
    | (merged_data["ZahlungsbetragBrutto"] == 0)
]

print(f"Number of positions missing payment info: {len(positions_missing_payment)}")

Number of positions missing payment info: 18026

### How much revenue is attributed to placeholder media ID '100000000'

In [58]:
media_100000000_revenue = merged_data[merged_data["Bildnummer"] == 100000000]
media_100000000_revenue = media_100000000_revenue.groupby("ReNummer")[
    "ZahlungsbetragBrutto"
].sum()
print(f"Revenue earned by media ID 100000000: {media_100000000_revenue.sum()}")

Revenue earned by media ID 100000000: 5289609.73

### How many invoices have no positions attached

In [64]:
invoices_missing_positions = merged_data[merged_data["ReId"].isna()]
print(f"Number of invoices missing positions: {len(invoices_missing_positions)}")

Number of invoices missing positions: 2